{
    "common": {
        "name":                     "gardena",
        "version":                  "2.3.0",
        "license":                  "MIT",
        "news": {
          "2.3.0": {
            "en": "a poll can be triggered manually by a state",
            "de": "Eine Abfrage kann manuell durch einen Status ausgelöst werden",
            "ru": "опрос может быть инициирован государством вручную",
            "pt": "uma enquete pode ser acionada manualmente por um estado",
            "nl": "een peiling kan handmatig door een staat worden getriggerd",
            "fr": "un sondage peut être déclenché manuellement par un état",
            "it": "un sondaggio può essere attivato manualmente da uno stato",
            "es": "una encuesta puede ser activada manualmente por un estado",
            "pl": "ankieta może zostać wywołana ręcznie przez stan",
            "zh-cn": "民意调查可以由州手动触发"
          },
          "2.2.0":  {
            "en": "added support for water outlet",
            "de": "Unterstützung für Wasseraustritt hinzugefügt",
            "ru": "добавлена ​​поддержка выхода воды",
            "pt": "adicionado suporte para saída de água",
            "nl": "extra ondersteuning voor waterafvoer",
            "fr": "support supplémentaire pour la sortie d'eau",
            "it": "aggiunto supporto per l'uscita dell'acqua",
            "es": "soporte añadido para la salida de agua",
            "pl": "dodano obsługę wylotu wody",
            "zh-cn": "增加了对出水口的支持"
          },
          "2.1.1": {
            "en": "command states set to writeable",
            "de": "Befehlszustände auf beschreibbar gesetzt",
            "ru": "состояния команд установлены на запись",
            "pt": "estados de comando definidos como graváveis",
            "nl": "commandostaten ingesteld op beschrijfbaar",
            "fr": "états de commande réglés en écriture",
            "it": "stati di comando impostati su scrivibili",
            "es": "estados de comando configurados en escritura",
            "pl": "stan poleceń ustawiony na zapisywalny",
            "zh-cn": "命令状态设置为可写"
          },
          "2.1.0": {
            "en": "Added support for compact mode.",
            "de": "Unterstützung für den Kompaktmodus hinzugefügt.",
            "ru": "Добавлена ​​поддержка компактного режима.",
            "pt": "Adicionado suporte para o modo compacto.",
            "nl": "Ondersteuning toegevoegd voor de compacte modus.",
            "fr": "Ajout du support pour le mode compact.",
            "it": "Aggiunto il supporto per la modalità compatta.",
            "es": "Añadido soporte para el modo compacto.",
            "pl": "Dodano obsługę trybu kompaktowego.",
            "zh-cn": "增加了对紧凑模式的支持。"
          },
          "2.0.2": {
            "en": "unnecessary user groups are no longer created",
            "de": "unnötige Benutzergruppen werden nicht mehr erstellt",
            "ru": "ненужные группы пользователей больше не создаются",
            "pt": "grupos de usuários desnecessários não são mais criados",
            "nl": "onnodige gebruikersgroepen worden niet langer aangemaakt",
            "fr": "les groupes d'utilisateurs inutiles ne sont plus créés",
            "it": "i gruppi di utenti non necessari non vengono più creati",
            "es": "grupos de usuarios innecesarios ya no se crean",
            "pl": "niepotrzebne grupy użytkowników nie są już tworzone",
            "zh-cn": "不再创建不必要的用户组"
          },
          "2.0.1": {
            "en": "fixed problem where some SMART states were not updated",
            "de": "Problem behoben, bei dem einige SMART-Zustände nicht aktualisiert wurden",
            "ru": "исправлена ​​проблема, когда некоторые SMART-состояния не обновлялись",
            "pt": "problema fixo em que alguns estados SMART não foram atualizados",
            "nl": "opgelost probleem waar sommige SMART-staten niet werden bijgewerkt",
            "fr": "problème résolu où certains états SMART n'étaient pas mis à jour",
            "it": "problema risolto in cui alcuni stati SMART non sono stati aggiornati",
            "es": "Se solucionó el problema donde algunos estados SMART no se actualizaron",
            "pl": "naprawiono problem, w którym niektóre SMART stany nie były aktualizowane"
          },
          "2.0.0":  {
            "en": "Datapoints for the ioBroker-database can be selected from the Gardena web service. Generic support for Gardena devices that support RESTful interactions.",
            "de": "Datenpunkte für die ioBroker-Datenbank können aus dem Gardena-Webservice ausgewählt werden. Generische Unterstützung für Gardena-Geräte, die REST-konforme Interaktionen unterstützen.",
            "ru": "Datapoints для базы данных ioBroker можно выбрать из веб-службы Gardena. Общая поддержка устройств Gardena, поддерживающих взаимодействие RESTful.",
            "pt": "Os pontos de dados para o banco de dados do ioBroker podem ser selecionados no serviço da web do Gardena. Suporte genérico para dispositivos Gardena que suportam interações RESTful.",
            "nl": "Datapunten voor de ioBroker-database kunnen worden geselecteerd via de Gardena-webservice. Generieke ondersteuning voor Gardena-apparaten die RESTful interacties ondersteunen.",
            "fr": "Les points de données pour la base de données ioBroker peuvent être sélectionnés à partir du service Web Gardena. Prise en charge générique des périphériques Gardena prenant en charge les interactions RESTful.",
            "it": "I datapoint per il database ioBroker possono essere selezionati dal servizio web di Gardena. Supporto generico per dispositivi Gardena che supportano interazioni RESTful.",
            "es": "Los puntos de datos para la base de datos ioBroker se pueden seleccionar desde el servicio web de Gardena. Soporte genérico para dispositivos Gardena que admiten interacciones REST.",
            "pl": "Datapoint dla bazy danych ioBroker można wybrać z serwisu internetowego Gardena. Ogólna obsługa urządzeń Gardena obsługujących interakcje RESTULT."
          }
        },
        "title": "Gardena Smart System",
        "titleLang": {
          "en": "an adapter for the Gardena Smart System webservice",
          "de": "ein Adapter für den Gardena Smart System Webservice",
          "ru": "адаптер для веб-службы Gardena Smart System",
          "pt": "um adaptador para o webservice do Gardena Smart System",
          "nl": "een adapter voor de webservice van Gardena Smart System",
          "fr": "un adaptateur pour le webservice Gardena Smart System",
          "it": "un adattatore per il webservice Gardena Smart System",
          "es": "Un adaptador para el servicio web Gardena Smart System.",
          "pl": "adapter do usługi sieciowej Gardena Smart System"
        },
        "desc":  {
          "en": "This adapter can retrieve data from and send commands to Gardena Smart System webservice.",
          "de": "Dieser Adapter kann Daten vom Gardena Smart System Webservice abrufen und senden.",
          "ru": "Этот адаптер может извлекать данные из и отправлять команды в веб-сервис Gardena Smart System.",
          "pt": "Este adaptador pode recuperar dados e enviar comandos para o serviço Web do Gardena Smart System.",
          "nl": "Met deze adapter kunnen gegevens worden opgehaald en opdrachten worden verzonden naar de webservice van Gardena Smart System.",
          "fr": "Cet adaptateur peut extraire des données et envoyer des commandes au service Web Gardena Smart System.",
          "it": "Questo adattatore può recuperare dati e inviare comandi al servizio web Gardena Smart System.",
          "es": "Este adaptador puede recuperar datos y enviar comandos al servicio web Gardena Smart System.",
          "pl": "Ten adapter może pobierać dane zi wysyłać polecenia do usługi sieciowej Gardena Smart System."
        },
        "platform":                 "Javascript/Node.js",
        "mode":                     "daemon",
        "icon":                     "gardena.png",
        "enabled":                  false,
        "compact":                  true,
        "extIcon":                  "https://raw.githubusercontent.com/t4qjXH8N/ioBroker.gardena/master/admin/gardena.png",
        "keywords":                 ["gardena", "gardena smart system"],
        "readme":                   "https://github.com/t4qjXH8N/ioBroker.gardena/blob/master/README.md",
        "loglevel":                 "info",
        "type":                     "garden",
        "restartAdapters":          [],
        "materialize":              true,
        "messagebox":               true,
        "authors": [
            {
                "name": "Christian Vorholt",
                "email": "chvorholt@gmail.com"
            }
        ]
    },
    "native": {
        "gardena_username": "me@me.com",
        "gardena_password": "secret",
        "gardena_reconnect_interval": "300",
        "gardena_polling_interval": "600"
    },
    "objects": [],
    "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "name": "connected",
        "desc": "Connected to Gardena Smart System Service?",
        "type": "boolean",
        "def": "false",
        "read": "true",
        "role": "value.info",
        "write": "false"
      },
      "native": {}
    },
    {
      "_id": "datapoints",
      "type": "",
      "common": {
        "name": "Datapoints",
        "desc": "Subscribed datapoints from the Gardena cloud."
      },
      "native": {}
    },
    {
      "_id": "locations",
      "type": "",
      "common": {
        "name": "Locations",
        "desc": "Locations from the Gardena cloud."
      },
      "native": {}
    },
    {
      "_id": "trigger_poll",
      "type": "state",
      "common": {
        "name": "poll",
        "desc": "Setting to true triggers a poll.",
        "type": "boolean",
        "def": "false",
        "read": "true",
        "write": "true",
        "role": "button"
      },
      "native": {}
    }
  ]
}
